contiki-os/contiki/cc26xxware/driverlib/aon_rtc.h
//*****************************************************************************
//
//! \brief Set the channel 2 increment value when operating in continuous mode.
//!
//! Set the channel 2 increment value when operating in continuous mode.
//! The specified value is automatically incremented to the channel 2 compare
//! register, upon a channel 2 compare event. This allows channel 2 to generate
//! a series of completely equidistant events.
//!
//! \param ui32IncValue is the increment value when operating in continuous mode.
//!
//! \return None
//!
//! \sa AONRTCIncValueCh2Get()
//
//*****************************************************************************
__STATIC_INLINE void
AONRTCIncValueCh2Set(uint32_t ui32IncValue)
{
    HWREG(AON_RTC_BASE + AON_RTC_O_CH2CMPINC) = ui32IncValue;
}

//*****************************************************************************
//
//! \brief Get the channel2 increment value when operating in continuous mode.
//!
//! Get the channel 2 increment value, when channel 2 is operating in
//! continuous mode.
//! This value is automatically incremented to the channel 2 compare
//! register, upon a channel 2 compare event. This allows channel 2 to
//! generate a series of completely equidistant events.
//!
//! \return Returns the channel 2 increment value when operating in continuous
//! mode.
//!
//! \sa AONRTCIncValueCh2Set()
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONRTCIncValueCh2Get(void)
{
    return (HWREG(AON_RTC_BASE + AON_RTC_O_CH2CMPINC));
}

//*****************************************************************************
//
//! \brief Get the channel 1 capture value.
//!
//! Get the channel 1 capture value.
//! The upper 16 bits of the returned value is the lower 16 bits of the
//! integer part of the RTC timer. The lower 16 bits of the returned part
//! is the upper 16 bits of the fractional part.
//!
//! \return Returns the channel 1 capture value.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONRTCCaptureValueCh1Get(void)
{
    return (HWREG(AON_RTC_BASE + AON_RTC_O_CH1CAPT));
}

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#ifndef DRIVERLIB_NOROM
    #include <driverlib/rom.h>
    #ifdef ROM_AONRTCStatus
        #undef  AONRTCStatus
        #define AONRTCStatus                    ROM_AONRTCStatus
    #endif
    #ifdef ROM_AONRTCEventClear
        #undef  AONRTCEventClear
        #define AONRTCEventClear                ROM_AONRTCEventClear
    #endif
    #ifdef ROM_AONRTCEventGet
        #undef  AONRTCEventGet
        #define AONRTCEventGet                  ROM_AONRTCEventGet
    #endif
    #ifdef ROM_AONRTCModeCh1Set
        #undef  AONRTCModeCh1Set
        #define AONRTCModeCh1Set                ROM_AONRTCModeCh1Set
    #endif
    #ifdef ROM_AONRTCModeCh1Get
        #undef  AONRTCModeCh1Get
        #define AONRTCModeCh1Get                ROM_AONRTCModeCh1Get
    #endif
    #ifdef ROM_AONRTCModeCh2Set
        #undef  AONRTCModeCh2Set
        #define AONRTCModeCh2Set                ROM_AONRTCModeCh2Set
    #endif
    #ifdef ROM_AONRTCModeCh2Get
        #undef  AONRTCModeCh2Get
        #define AONRTCModeCh2Get                ROM_AONRTCModeCh2Get
    #endif
    #ifdef ROM_AONRTCChannelEnable
        #undef  AONRTCChannelEnable
        #define AONRTCChannelEnable             ROM_AONRTCChannelEnable
    #endif
    #ifdef ROM_AONRTCChannelDisable
        #undef  AONRTCChannelDisable
        #define AONRTCChannelDisable            ROM_AONRTCChannelDisable
    #endif
    #ifdef ROM_AONRTCCompareValueSet
        #undef  AONRTCCompareValueSet
        #define AONRTCCompareValueSet           ROM_AONRTCCompareValueSet
    #endif
    #ifdef ROM_AONRTCCompareValueGet
        #undef  AONRTCCompareValueGet
        #define AONRTCCompareValueGet           ROM_AONRTCCompareValueGet
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif //  __AON_RTC_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//
//*****************************************************************************
